In [1]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

Use pandas to read the olympic_medals.csv from the DATA folder on Google Drive. Then perform the followings by using pandas and/or Python built-in functions.

In [19]:
import pandas as pd
df = pd.read_csv('/content/drive/MyDrive/DATA/olympic_medals.csv')

df.head()

Gender         object
Event          object
Location       object
Year            int64
Medal          object
Name           object
Nationality    object
Result         object
dtype: object

(a) Find the size of the data frame. How many rows, how many columns?

In [6]:
rows, cols = df.shape
print(f'Rows: {rows}, Columns: {cols}')

Rows: 2394, Columns: 8

(b) Use the appropriate function to report the data types for all columns.

In [20]:
df.dtypes

Gender         object
Event          object
Location       object
Year            int64
Medal          object
Name           object
Nationality    object
Result         object
dtype: object

(c) Find how many unique cities matches were held at (Hint: unique(). For instance the following example tells how many unique Events held:)


```
len(medals['Event'].unique())
```

In [11]:
unique_cities = len(df['Location'].unique())
print(f'Unique cities: {unique_cities}')

Unique cities: 23

(d) Find how many medals the USA team won in total.

In [12]:
usa_medals = df[df['Nationality'] == 'USA']
print(f'USA medals: {len(usa_medals)}')

USA medals: 638

(e) Find the total number of medals for each Nationality. (Hint: please search for groupby() function with count. For instance, the following example counts at how many locations each event was held.)

```
medals.groupby(by='Event')['Location'].count()
```

In [13]:
df.groupby(by='Nationality')['Medal'].count()

Nationality
ALG      9
ARG      4
AUS     57
AUT      4
BAH     12
      ...
URS    131
USA    638
VEN      2
YUG      1
ZAM      1
Name: Medal, Length: 97, dtype: int64